rakshith07/AUTOSAR-like-MCAL/MCAL/HW_Drivers/STM32F103Cxx.h
/*
 * STM32F103Cxx.h
 *
 *  Created on: Feb 5, 2024
 *      Author: Rakshith Guruswamy
 */

#ifndef STM32F103CXX_H_
#define STM32F103CXX_H_


#include "Platform_Types.h"

#define assert_param(expr) ((void)0)

typedef struct
{
  volatile uint32 CR;
  volatile uint32 CFGR;
  volatile uint32 CIR;
  volatile uint32 APB2RSTR;
  volatile uint32 APB1RSTR;
  volatile uint32 AHBENR;
  volatile uint32 APB2ENR;
  volatile uint32 APB1ENR;
  volatile uint32 BDCR;
  volatile uint32 CSR;
  volatile uint32 AHBRSTR;
  volatile uint32 CFGR2;
} RCC_ts;

typedef struct
{
  volatile uint32 CRL;
  volatile uint32 CRH;
  volatile uint32 IDR;
  volatile uint32 ODR;
  volatile uint32 BSRR;
  volatile uint32 BRR;
  volatile uint32 LCKR;
} GPIO_ts;

#define FLASH_BASE            ((uint32)0x08000000)
#define SRAM_BASE             ((uint32)0x20000000)
#define PERIPH_BASE           ((uint32)0x40000000)

/* Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)

#define GPIOA_BASE            (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE            (APB2PERIPH_BASE + 0x1800)
#define GPIOF_BASE            (APB2PERIPH_BASE + 0x1C00)
#define GPIOG_BASE            (APB2PERIPH_BASE + 0x2000)

#define RCC_BASE              (AHBPERIPH_BASE + 0x1000)

#define GPIOA               ((GPIO_ts *) GPIOA_BASE)
#define GPIOB               ((GPIO_ts *) GPIOB_BASE)
#define GPIOC               ((GPIO_ts *) GPIOC_BASE)
#define GPIOD               ((GPIO_ts *) GPIOD_BASE)
#define GPIOE               ((GPIO_ts *) GPIOE_BASE)
#define GPIOF               ((GPIO_ts *) GPIOF_BASE)
#define GPIOG               ((GPIO_ts *) GPIOG_BASE)

#define RCC                 ((RCC_ts *) RCC_BASE)

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ((uint32)0x00000001)        /* Internal High Speed clock enable */
#define  RCC_CR_HSIRDY                       ((uint32)0x00000002)        /* Internal High Speed clock ready flag */
#define  RCC_CR_HSITRIM                      ((uint32)0x000000F8)        /* Internal High Speed clock trimming */
#define  RCC_CR_HSICAL                       ((uint32)0x0000FF00)        /* Internal High Speed clock Calibration */
#define  RCC_CR_HSEON                        ((uint32)0x00010000)        /* External High Speed clock enable */
#define  RCC_CR_HSERDY                       ((uint32)0x00020000)        /* External High Speed clock ready flag */
#define  RCC_CR_HSEBYP                       ((uint32)0x00040000)        /* External High Speed clock Bypass */
#define  RCC_CR_CSSON                        ((uint32)0x00080000)        /* Clock Security System enable */
#define  RCC_CR_PLLON                        ((uint32)0x01000000)        /* PLL enable */
#define  RCC_CR_PLLRDY                       ((uint32)0x02000000)        /* PLL clock ready flag */

/*******************  Bit definition for RCC_CFGR register  *******************/
/* SW configuration */
#define  RCC_CFGR_SW                         ((uint32)0x00000003)        /* SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       ((uint32)0x00000001)        /* Bit 0 */
#define  RCC_CFGR_SW_1                       ((uint32)0x00000002)        /* Bit 1 */

#define  RCC_CFGR_SW_HSI                     ((uint32)0x00000000)        /* HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     ((uint32)0x00000001)        /* HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     ((uint32)0x00000002)        /* PLL selected as system clock */

/* SWS configuration */
#define  RCC_CFGR_SWS                        ((uint32)0x0000000C)        /* SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      ((uint32)0x00000004)        /* Bit 0 */
#define  RCC_CFGR_SWS_1                      ((uint32)0x00000008)        /* Bit 1 */

#define  RCC_CFGR_SWS_HSI                    ((uint32)0x00000000)        /* HSI oscillator used as system clock */
#define  RCC_CFGR_SWS_HSE                    ((uint32)0x00000004)        /* HSE oscillator used as system clock */
#define  RCC_CFGR_SWS_PLL                    ((uint32)0x00000008)        /* PLL used as system clock */

/* HPRE configuration */
#define  RCC_CFGR_HPRE                       ((uint32)0x000000F0)        /* HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     ((uint32)0x00000010)        /* Bit 0 */
#define  RCC_CFGR_HPRE_1                     ((uint32)0x00000020)        /* Bit 1 */
#define  RCC_CFGR_HPRE_2                     ((uint32)0x00000040)        /* Bit 2 */
#define  RCC_CFGR_HPRE_3                     ((uint32)0x00000080)        /* Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  ((uint32)0x00000000)        /* SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  ((uint32)0x00000080)        /* SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  ((uint32)0x00000090)        /* SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  ((uint32)0x000000A0)        /* SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 ((uint32)0x000000B0)        /* SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 ((uint32)0x000000C0)        /* SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                ((uint32)0x000000D0)        /* SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                ((uint32)0x000000E0)        /* SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                ((uint32)0x000000F0)        /* SYSCLK divided by 512 */

