rakshith07/AUTOSAR-like-MCAL/MCAL/HW_Drivers/STM32F103Cxx.h
/* PPRE1 configuration */
#define  RCC_CFGR_PPRE1                      ((uint32)0x00000700)        /* PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_CFGR_PPRE1_0                    ((uint32)0x00000100)        /* Bit 0 */
#define  RCC_CFGR_PPRE1_1                    ((uint32)0x00000200)        /* Bit 1 */
#define  RCC_CFGR_PPRE1_2                    ((uint32)0x00000400)        /* Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 ((uint32)0x00000000)        /* HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 ((uint32)0x00000400)        /* HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 ((uint32)0x00000500)        /* HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 ((uint32)0x00000600)        /* HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                ((uint32)0x00000700)        /* HCLK divided by 16 */

/* PPRE2 configuration */
#define  RCC_CFGR_PPRE2                      ((uint32)0x00003800)        /* PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    ((uint32)0x00000800)        /* Bit 0 */
#define  RCC_CFGR_PPRE2_1                    ((uint32)0x00001000)        /* Bit 1 */
#define  RCC_CFGR_PPRE2_2                    ((uint32)0x00002000)        /* Bit 2 */

#define  RCC_CFGR_PPRE2_DIV1                 ((uint32)0x00000000)        /* HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 ((uint32)0x00002000)        /* HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 ((uint32)0x00002800)        /* HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 ((uint32)0x00003000)        /* HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                ((uint32)0x00003800)        /* HCLK divided by 16 */

/* ADCPPRE configuration */
#define  RCC_CFGR_ADCPRE                     ((uint32)0x0000C000)        /* ADCPRE[1:0] bits (ADC prescaler) */
#define  RCC_CFGR_ADCPRE_0                   ((uint32)0x00004000)        /* Bit 0 */
#define  RCC_CFGR_ADCPRE_1                   ((uint32)0x00008000)        /* Bit 1 */

#define  RCC_CFGR_ADCPRE_DIV2                ((uint32)0x00000000)        /* PCLK2 divided by 2 */
#define  RCC_CFGR_ADCPRE_DIV4                ((uint32)0x00004000)        /* PCLK2 divided by 4 */
#define  RCC_CFGR_ADCPRE_DIV6                ((uint32)0x00008000)        /* PCLK2 divided by 6 */
#define  RCC_CFGR_ADCPRE_DIV8                ((uint32)0x0000C000)        /* PCLK2 divided by 8 */

#define  RCC_CFGR_PLLSRC                     ((uint32)0x00010000)        /* PLL entry clock source */

#define  RCC_CFGR_PLLXTPRE                   ((uint32)0x00020000)        /* HSE divider for PLL entry */

/* PLLMUL configuration */
#define  RCC_CFGR_PLLMULL                    ((uint32)0x003C0000)        /* PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_CFGR_PLLMULL_0                  ((uint32)0x00040000)        /* Bit 0 */
#define  RCC_CFGR_PLLMULL_1                  ((uint32)0x00080000)        /* Bit 1 */
#define  RCC_CFGR_PLLMULL_2                  ((uint32)0x00100000)        /* Bit 2 */
#define  RCC_CFGR_PLLMULL_3                  ((uint32)0x00200000)        /* Bit 3 */

#define  RCC_CFGR_PLLMULL2                   ((uint32)0x00000000)        /* PLL input clock*2 */
#define  RCC_CFGR_PLLMULL3                   ((uint32)0x00040000)        /* PLL input clock*3 */
#define  RCC_CFGR_PLLMULL4                   ((uint32)0x00080000)        /* PLL input clock*4 */
#define  RCC_CFGR_PLLMULL5                   ((uint32)0x000C0000)        /* PLL input clock*5 */
#define  RCC_CFGR_PLLMULL6                   ((uint32)0x00100000)        /* PLL input clock*6 */
#define  RCC_CFGR_PLLMULL7                   ((uint32)0x00140000)        /* PLL input clock*7 */
#define  RCC_CFGR_PLLMULL8                   ((uint32)0x00180000)        /* PLL input clock*8 */
#define  RCC_CFGR_PLLMULL9                   ((uint32)0x001C0000)        /* PLL input clock*9 */
#define  RCC_CFGR_PLLMULL10                  ((uint32)0x00200000)        /* PLL input clock10 */
#define  RCC_CFGR_PLLMULL11                  ((uint32)0x00240000)        /* PLL input clock*11 */
#define  RCC_CFGR_PLLMULL12                  ((uint32)0x00280000)        /* PLL input clock*12 */
#define  RCC_CFGR_PLLMULL13                  ((uint32)0x002C0000)        /* PLL input clock*13 */
#define  RCC_CFGR_PLLMULL14                  ((uint32)0x00300000)        /* PLL input clock*14 */
#define  RCC_CFGR_PLLMULL15                  ((uint32)0x00340000)        /* PLL input clock*15 */
#define  RCC_CFGR_PLLMULL16                  ((uint32)0x00380000)        /* PLL input clock*16 */

#define  RCC_CFGR_OTGFSPRE                   ((uint32)0x00400000)        /* USB OTG FS prescaler */

/* MCO configuration */
 #define  RCC_CFGR_MCO                       ((uint32)0x07000000)        /* MCO[2:0] bits (Microcontroller Clock Output) */
 #define  RCC_CFGR_MCO_0                     ((uint32)0x01000000)        /* Bit 0 */
 #define  RCC_CFGR_MCO_1                     ((uint32)0x02000000)        /* Bit 1 */
 #define  RCC_CFGR_MCO_2                     ((uint32)0x04000000)        /* Bit 2 */

 #define  RCC_CFGR_MCO_NOCLOCK               ((uint32)0x00000000)        /* No clock */
 #define  RCC_CFGR_MCO_SYSCLK                ((uint32)0x04000000)        /* System clock selected as MCO source */
 #define  RCC_CFGR_MCO_HSI                   ((uint32)0x05000000)        /* HSI clock selected as MCO source */
 #define  RCC_CFGR_MCO_HSE                   ((uint32)0x06000000)        /* HSE clock selected as MCO source  */
 #define  RCC_CFGR_MCO_PLL                   ((uint32)0x07000000)        /* PLL clock divided by 2 selected as MCO source */

/*******************  Bit definition for RCC_CIR register  ********************/
#define  RCC_CIR_LSIRDYF                     ((uint32)0x00000001)        /* LSI Ready Interrupt flag */
#define  RCC_CIR_LSERDYF                     ((uint32)0x00000002)        /* LSE Ready Interrupt flag */
#define  RCC_CIR_HSIRDYF                     ((uint32)0x00000004)        /* HSI Ready Interrupt flag */
#define  RCC_CIR_HSERDYF                     ((uint32)0x00000008)        /* HSE Ready Interrupt flag */
#define  RCC_CIR_PLLRDYF                     ((uint32)0x00000010)        /* PLL Ready Interrupt flag */
#define  RCC_CIR_CSSF                        ((uint32)0x00000080)        /* Clock Security System Interrupt flag */
#define  RCC_CIR_LSIRDYIE                    ((uint32)0x00000100)        /* LSI Ready Interrupt Enable */
#define  RCC_CIR_LSERDYIE                    ((uint32)0x00000200)        /* LSE Ready Interrupt Enable */
#define  RCC_CIR_HSIRDYIE                    ((uint32)0x00000400)        /* HSI Ready Interrupt Enable */
#define  RCC_CIR_HSERDYIE                    ((uint32)0x00000800)        /* HSE Ready Interrupt Enable */
#define  RCC_CIR_PLLRDYIE                    ((uint32)0x00001000)        /* PLL Ready Interrupt Enable */
#define  RCC_CIR_LSIRDYC                     ((uint32)0x00010000)        /* LSI Ready Interrupt Clear */
#define  RCC_CIR_LSERDYC                     ((uint32)0x00020000)        /* LSE Ready Interrupt Clear */
#define  RCC_CIR_HSIRDYC                     ((uint32)0x00040000)        /* HSI Ready Interrupt Clear */
#define  RCC_CIR_HSERDYC                     ((uint32)0x00080000)        /* HSE Ready Interrupt Clear */
#define  RCC_CIR_PLLRDYC                     ((uint32)0x00100000)        /* PLL Ready Interrupt Clear */
#define  RCC_CIR_CSSC                        ((uint32)0x00800000)        /* Clock Security System Interrupt Clear */

