rakshith07/AUTOSAR-like-MCAL/MCAL/HW_Drivers/STM32F103Cxx.h
/*****************  Bit definition for RCC_APB2RSTR register  *****************/
#define  RCC_APB2RSTR_AFIORST                ((uint32)0x00000001)        /* Alternate Function I/O reset */
#define  RCC_APB2RSTR_IOPARST                ((uint32)0x00000004)        /* I/O port A reset */
#define  RCC_APB2RSTR_IOPBRST                ((uint32)0x00000008)        /* I/O port B reset */
#define  RCC_APB2RSTR_IOPCRST                ((uint32)0x00000010)        /* I/O port C reset */
#define  RCC_APB2RSTR_IOPDRST                ((uint32)0x00000020)        /* I/O port D reset */
#define  RCC_APB2RSTR_IOPERST                ((uint32)0x00000040)        /* I/O port E reset */
#define  RCC_APB2RSTR_IOPFRST                ((uint32)0x00000080)        /* I/O port F reset */
#define  RCC_APB2RSTR_IOPGRST                ((uint32)0x00000100)        /* I/O port G reset */
#define  RCC_APB2RSTR_ADC1RST                ((uint32)0x00000200)        /* ADC 1 interface reset */
#define  RCC_APB2RSTR_ADC2RST                ((uint32)0x00000400)        /* ADC 2 interface reset */
#define  RCC_APB2RSTR_TIM1RST                ((uint32)0x00000800)        /* TIM1 Timer reset */
#define  RCC_APB2RSTR_SPI1RST                ((uint32)0x00001000)        /* SPI 1 reset */
#define  RCC_APB2RSTR_TIM8RST                ((uint32)0x00002000)        /* TIM8 Timer reset */
#define  RCC_APB2RSTR_USART1RST              ((uint32)0x00004000)        /* USART1 reset */
#define  RCC_APB2RSTR_ADC3RST                ((uint32)0x00008000)        /* ADC3 interface reset */
#define  RCC_APB2RSTR_TIM9RST                ((uint32)0x00080000)        /* TIM9 Timer reset */
#define  RCC_APB2RSTR_TIM10RST               ((uint32)0x00100000)        /* TIM10 Timer reset */
#define  RCC_APB2RSTR_TIM11RST               ((uint32)0x00200000)        /* TIM11 Timer reset */

/*****************  Bit definition for RCC_APB1RSTR register  *****************/
#define  RCC_APB1RSTR_TIM2RST                ((uint32)0x00000001)        /* Timer 2 reset */
#define  RCC_APB1RSTR_TIM3RST                ((uint32)0x00000002)        /* Timer 3 reset */
#define  RCC_APB1RSTR_TIM4RST                ((uint32)0x00000004)        /* Timer 4 reset */
#define  RCC_APB1RSTR_TIM5RST                ((uint32)0x00000008)        /* Timer 5 reset */
#define  RCC_APB1RSTR_TIM6RST                ((uint32)0x00000010)        /* Timer 6 reset */
#define  RCC_APB1RSTR_TIM7RST                ((uint32)0x00000020)        /* Timer 7 reset */
#define  RCC_APB1RSTR_TIM12RST               ((uint32)0x00000040)        /* TIM12 Timer reset */
#define  RCC_APB1RSTR_TIM13RST               ((uint32)0x00000080)        /* TIM13 Timer reset */
#define  RCC_APB1RSTR_TIM14RST               ((uint32)0x00000100)        /* TIM14 Timer reset */
#define  RCC_APB1RSTR_WWDGRST                ((uint32)0x00000800)        /* Window Watchdog reset */
#define  RCC_APB1RSTR_SPI2RST                ((uint32)0x00004000)        /* SPI 2 reset */
#define  RCC_APB1RSTR_SPI3RST                ((uint32)0x00008000)        /* SPI 3 reset */
#define  RCC_APB1RSTR_USART2RST              ((uint32)0x00020000)        /* USART 2 reset */
#define  RCC_APB1RSTR_USART3RST              ((uint32)0x00040000)        /* RUSART 3 reset */
#define  RCC_APB1RSTR_UART4RST               ((uint32)0x00080000)        /* UART 4 reset */
#define  RCC_APB1RSTR_UART5RST               ((uint32)0x00100000)        /* UART 5 reset */
#define  RCC_APB1RSTR_I2C1RST                ((uint32)0x00200000)        /* I2C 1 reset */
#define  RCC_APB1RSTR_I2C2RST                ((uint32)0x00400000)        /* I2C 2 reset */
#define  RCC_APB1RSTR_USBRST                 ((uint32)0x00800000)        /* USB Device reset */
#define  RCC_APB1RSTR_CANRST                 ((uint32)0x02000000)        /* CAN reset */
#define  RCC_APB1RSTR_BKPRST                 ((uint32)0x08000000)        /* Backup interface reset */
#define  RCC_APB1RSTR_PWRRST                 ((uint32)0x10000000)        /* Power interface reset */
#define  RCC_APB1RSTR_DACRST                 ((uint32)0x20000000)        /* DAC interface reset */

/******************  Bit definition for RCC_AHBENR register  ******************/
#define  RCC_AHBENR_DMA1EN                   ((uint16)0x0001)            /* DMA1 clock enable */
#define  RCC_AHBENR_DMA2EN                   ((uint16)0x0002)            /* DMA2 clock enable */
#define  RCC_AHBENR_SRAMEN                   ((uint16)0x0004)            /* SRAM interface clock enable */
#define  RCC_AHBENR_FLITFEN                  ((uint16)0x0010)            /* FLITF clock enable */
#define  RCC_AHBENR_CRCEN                    ((uint16)0x0040)            /* CRC clock enable */
#define  RCC_AHBENR_FSMCEN                   ((uint16)0x0100)            /* FSMC clock enable */
#define  RCC_AHBENR_SDIOEN                   ((uint16)0x0400)            /* SDIO clock enable */

/******************  Bit definition for RCC_APB2ENR register  *****************/
#define  RCC_APB2ENR_AFIOEN                  ((uint32)0x00000001)         /* Alternate Function I/O clock enable */
#define  RCC_APB2ENR_IOPAEN                  ((uint32)0x00000004)         /* I/O port A clock enable */
#define  RCC_APB2ENR_IOPBEN                  ((uint32)0x00000008)         /* I/O port B clock enable */
#define  RCC_APB2ENR_IOPCEN                  ((uint32)0x00000010)         /* I/O port C clock enable */
#define  RCC_APB2ENR_IOPDEN                  ((uint32)0x00000020)         /* I/O port D clock enable */
#define  RCC_APB2ENR_IOPEEN                  ((uint32)0x00000040)         /* I/O port E clock enable */
#define  RCC_APB2ENR_IOPFEN                  ((uint32)0x00000080)         /* I/O port F clock enable */
#define  RCC_APB2ENR_IOPGEN                  ((uint32)0x00000100)         /* I/O port G clock enable */
#define  RCC_APB2ENR_ADC1EN                  ((uint32)0x00000200)         /* ADC 1 interface clock enable */
#define  RCC_APB2ENR_ADC2EN                  ((uint32)0x00000400)         /* ADC 2 interface clock enable */
#define  RCC_APB2ENR_TIM1EN                  ((uint32)0x00000800)         /* TIM1 Timer clock enable */
#define  RCC_APB2ENR_SPI1EN                  ((uint32)0x00001000)         /* SPI 1 clock enable */
#define  RCC_APB2ENR_TIM8EN                  ((uint32)0x00002000)         /* TIM8 Timer clock enable */
#define  RCC_APB2ENR_USART1EN                ((uint32)0x00004000)         /* USART1 clock enable */
#define  RCC_APB2ENR_ADC3EN                  ((uint32)0x00008000)         /* DMA1 clock enable */
#define  RCC_APB2ENR_TIM9EN                  ((uint32)0x00080000)         /* TIM9 Timer clock enable  */
#define  RCC_APB2ENR_TIM10EN                 ((uint32)0x00100000)         /* TIM10 Timer clock enable  */
#define  RCC_APB2ENR_TIM11EN                 ((uint32)0x00200000)         /* TIM11 Timer clock enable */

/*****************  Bit definition for RCC_APB1ENR register  ******************/
#define  RCC_APB1ENR_TIM2EN                  ((uint32)0x00000001)        /* Timer 2 clock enabled*/
#define  RCC_APB1ENR_TIM3EN                  ((uint32)0x00000002)        /* Timer 3 clock enable */
#define  RCC_APB1ENR_TIM4EN                  ((uint32)0x00000004)        /* Timer 4 clock enable */
#define  RCC_APB1ENR_TIM5EN                  ((uint32)0x00000008)        /* Timer 5 clock enable */
#define  RCC_APB1ENR_TIM6EN                  ((uint32)0x00000010)        /* Timer 6 clock enable */
#define  RCC_APB1ENR_TIM7EN                  ((uint32)0x00000020)        /* Timer 7 clock enable */
#define  RCC_APB1ENR_TIM12EN                 ((uint32)0x00000040)        /* TIM12 Timer clock enable  */
#define  RCC_APB1ENR_TIM13EN                 ((uint32)0x00000080)        /* TIM13 Timer clock enable  */
#define  RCC_APB1ENR_TIM14EN                 ((uint32)0x00000100)        /* TIM14 Timer clock enable */
#define  RCC_APB1ENR_WWDGEN                  ((uint32)0x00000800)        /* Window Watchdog clock enable */
#define  RCC_APB1ENR_SPI2EN                  ((uint32)0x00004000)        /* SPI 2 clock enable */
#define  RCC_APB1ENR_SPI3EN                  ((uint32)0x00008000)        /* SPI 3 clock enable */
#define  RCC_APB1ENR_USART2EN                ((uint32)0x00020000)        /* USART 2 clock enable */
#define  RCC_APB1ENR_USART3EN                ((uint32)0x00040000)        /* USART 3 clock enable */
#define  RCC_APB1ENR_UART4EN                 ((uint32)0x00080000)        /* UART 4 clock enable */
#define  RCC_APB1ENR_UART5EN                 ((uint32)0x00100000)        /* UART 5 clock enable */
#define  RCC_APB1ENR_I2C1EN                  ((uint32)0x00200000)        /* I2C 1 clock enable */
#define  RCC_APB1ENR_I2C2EN                  ((uint32)0x00400000)        /* I2C 2 clock enable */
#define  RCC_APB1ENR_USBEN                   ((uint32)0x00800000)        /* USB Device clock enable */
#define  RCC_APB1ENR_CANEN                   ((uint32)0x02000000)        /* CAN clock enable */
#define  RCC_APB1ENR_BKPEN                   ((uint32)0x08000000)        /* Backup interface clock enable */
#define  RCC_APB1ENR_PWREN                   ((uint32)0x10000000)        /* Power interface clock enable */
#define  RCC_APB1ENR_DACEN                   ((uint32)0x20000000)        /* DAC interface clock enable */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define  RCC_BDCR_LSEON                      ((uint32)0x00000001)        /* External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     ((uint32)0x00000002)        /* External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     ((uint32)0x00000004)        /* External Low Speed oscillator Bypass */
#define  RCC_BDCR_RTCSEL                     ((uint32)0x00000300)        /* RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   ((uint32)0x00000100)        /* Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   ((uint32)0x00000200)        /* Bit 1 */
/* RTC congiguration */
#define  RCC_BDCR_RTCSEL_NOCLOCK             ((uint32)0x00000000)        /* No clock */
#define  RCC_BDCR_RTCSEL_LSE                 ((uint32)0x00000100)        /* LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 ((uint32)0x00000200)        /* LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 ((uint32)0x00000300)        /* HSE oscillator clock divided by 128 used as RTC clock */

#define  RCC_BDCR_RTCEN                      ((uint32)0x00008000)        /* RTC clock enable */
#define  RCC_BDCR_BDRST                      ((uint32)0x00010000)        /* Backup domain software reset  */


/******************************************************************************/
/*                                                                            */
/*                General Purpose and Alternate Function I/O                  */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for GPIO_CRL register  *******************/
#define  GPIO_CRL_MODE                       ((uint32)0x33333333)        /* Port x mode bits */

#define  GPIO_CRL_MODE0                      ((uint32)0x00000003)        /* MODE0[1:0] bits (Port x mode bits, pin 0) */
#define  GPIO_CRL_MODE0_0                    ((uint32)0x00000001)        /* Bit 0 */
#define  GPIO_CRL_MODE0_1                    ((uint32)0x00000002)        /* Bit 1 */

#define  GPIO_CRL_MODE1                      ((uint32)0x00000030)        /* MODE1[1:0] bits (Port x mode bits, pin 1) */
#define  GPIO_CRL_MODE1_0                    ((uint32)0x00000010)        /* Bit 0 */
#define  GPIO_CRL_MODE1_1                    ((uint32)0x00000020)        /* Bit 1 */

