rakshith07/AUTOSAR-like-MCAL/MCAL/HW_Drivers/STM32F103Cxx.h
#define  GPIO_CRH_CNF9                       ((uint32)0x000000C0)        /* CNF9[1:0] bits (Port x configuration bits, pin 9) */
#define  GPIO_CRH_CNF9_0                     ((uint32)0x00000040)        /* Bit 0 */
#define  GPIO_CRH_CNF9_1                     ((uint32)0x00000080)        /* Bit 1 */

#define  GPIO_CRH_CNF10                      ((uint32)0x00000C00)        /* CNF10[1:0] bits (Port x configuration bits, pin 10) */
#define  GPIO_CRH_CNF10_0                    ((uint32)0x00000400)        /* Bit 0 */
#define  GPIO_CRH_CNF10_1                    ((uint32)0x00000800)        /* Bit 1 */

#define  GPIO_CRH_CNF11                      ((uint32)0x0000C000)        /* CNF11[1:0] bits (Port x configuration bits, pin 11) */
#define  GPIO_CRH_CNF11_0                    ((uint32)0x00004000)        /* Bit 0 */
#define  GPIO_CRH_CNF11_1                    ((uint32)0x00008000)        /* Bit 1 */

#define  GPIO_CRH_CNF12                      ((uint32)0x000C0000)        /* CNF12[1:0] bits (Port x configuration bits, pin 12) */
#define  GPIO_CRH_CNF12_0                    ((uint32)0x00040000)        /* Bit 0 */
#define  GPIO_CRH_CNF12_1                    ((uint32)0x00080000)        /* Bit 1 */

#define  GPIO_CRH_CNF13                      ((uint32)0x00C00000)        /* CNF13[1:0] bits (Port x configuration bits, pin 13) */
#define  GPIO_CRH_CNF13_0                    ((uint32)0x00400000)        /* Bit 0 */
#define  GPIO_CRH_CNF13_1                    ((uint32)0x00800000)        /* Bit 1 */

#define  GPIO_CRH_CNF14                      ((uint32)0x0C000000)        /* CNF14[1:0] bits (Port x configuration bits, pin 14) */
#define  GPIO_CRH_CNF14_0                    ((uint32)0x04000000)        /* Bit 0 */
#define  GPIO_CRH_CNF14_1                    ((uint32)0x08000000)        /* Bit 1 */

#define  GPIO_CRH_CNF15                      ((uint32)0xC0000000)        /* CNF15[1:0] bits (Port x configuration bits, pin 15) */
#define  GPIO_CRH_CNF15_0                    ((uint32)0x40000000)        /* Bit 0 */
#define  GPIO_CRH_CNF15_1                    ((uint32)0x80000000)        /* Bit 1 */

/*******************  Bit definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR0                        ((uint16)0x0001)            /* Port input data, bit 0 */
#define GPIO_IDR_IDR1                        ((uint16)0x0002)            /* Port input data, bit 1 */
#define GPIO_IDR_IDR2                        ((uint16)0x0004)            /* Port input data, bit 2 */
#define GPIO_IDR_IDR3                        ((uint16)0x0008)            /* Port input data, bit 3 */
#define GPIO_IDR_IDR4                        ((uint16)0x0010)            /* Port input data, bit 4 */
#define GPIO_IDR_IDR5                        ((uint16)0x0020)            /* Port input data, bit 5 */
#define GPIO_IDR_IDR6                        ((uint16)0x0040)            /* Port input data, bit 6 */
#define GPIO_IDR_IDR7                        ((uint16)0x0080)            /* Port input data, bit 7 */
#define GPIO_IDR_IDR8                        ((uint16)0x0100)            /* Port input data, bit 8 */
#define GPIO_IDR_IDR9                        ((uint16)0x0200)            /* Port input data, bit 9 */
#define GPIO_IDR_IDR10                       ((uint16)0x0400)            /* Port input data, bit 10 */
#define GPIO_IDR_IDR11                       ((uint16)0x0800)            /* Port input data, bit 11 */
#define GPIO_IDR_IDR12                       ((uint16)0x1000)            /* Port input data, bit 12 */
#define GPIO_IDR_IDR13                       ((uint16)0x2000)            /* Port input data, bit 13 */
#define GPIO_IDR_IDR14                       ((uint16)0x4000)            /* Port input data, bit 14 */
#define GPIO_IDR_IDR15                       ((uint16)0x8000)            /* Port input data, bit 15 */

/*******************  Bit definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR0                        ((uint16)0x0001)            /* Port output data, bit 0 */
#define GPIO_ODR_ODR1                        ((uint16)0x0002)            /* Port output data, bit 1 */
#define GPIO_ODR_ODR2                        ((uint16)0x0004)            /* Port output data, bit 2 */
#define GPIO_ODR_ODR3                        ((uint16)0x0008)            /* Port output data, bit 3 */
#define GPIO_ODR_ODR4                        ((uint16)0x0010)            /* Port output data, bit 4 */
#define GPIO_ODR_ODR5                        ((uint16)0x0020)            /* Port output data, bit 5 */
#define GPIO_ODR_ODR6                        ((uint16)0x0040)            /* Port output data, bit 6 */
#define GPIO_ODR_ODR7                        ((uint16)0x0080)            /* Port output data, bit 7 */
#define GPIO_ODR_ODR8                        ((uint16)0x0100)            /* Port output data, bit 8 */
#define GPIO_ODR_ODR9                        ((uint16)0x0200)            /* Port output data, bit 9 */
#define GPIO_ODR_ODR10                       ((uint16)0x0400)            /* Port output data, bit 10 */
#define GPIO_ODR_ODR11                       ((uint16)0x0800)            /* Port output data, bit 11 */
#define GPIO_ODR_ODR12                       ((uint16)0x1000)            /* Port output data, bit 12 */
#define GPIO_ODR_ODR13                       ((uint16)0x2000)            /* Port output data, bit 13 */
#define GPIO_ODR_ODR14                       ((uint16)0x4000)            /* Port output data, bit 14 */
#define GPIO_ODR_ODR15                       ((uint16)0x8000)            /* Port output data, bit 15 */

/******************  Bit definition for GPIO_BSRR register  *******************/
#define GPIO_BSRR_BS0                        ((uint32)0x00000001)        /* Port x Set bit 0 */
#define GPIO_BSRR_BS1                        ((uint32)0x00000002)        /* Port x Set bit 1 */
#define GPIO_BSRR_BS2                        ((uint32)0x00000004)        /* Port x Set bit 2 */
#define GPIO_BSRR_BS3                        ((uint32)0x00000008)        /* Port x Set bit 3 */
#define GPIO_BSRR_BS4                        ((uint32)0x00000010)        /* Port x Set bit 4 */
#define GPIO_BSRR_BS5                        ((uint32)0x00000020)        /* Port x Set bit 5 */
#define GPIO_BSRR_BS6                        ((uint32)0x00000040)        /* Port x Set bit 6 */
#define GPIO_BSRR_BS7                        ((uint32)0x00000080)        /* Port x Set bit 7 */
#define GPIO_BSRR_BS8                        ((uint32)0x00000100)        /* Port x Set bit 8 */
#define GPIO_BSRR_BS9                        ((uint32)0x00000200)        /* Port x Set bit 9 */
#define GPIO_BSRR_BS10                       ((uint32)0x00000400)        /* Port x Set bit 10 */
#define GPIO_BSRR_BS11                       ((uint32)0x00000800)        /* Port x Set bit 11 */
#define GPIO_BSRR_BS12                       ((uint32)0x00001000)        /* Port x Set bit 12 */
#define GPIO_BSRR_BS13                       ((uint32)0x00002000)        /* Port x Set bit 13 */
#define GPIO_BSRR_BS14                       ((uint32)0x00004000)        /* Port x Set bit 14 */
#define GPIO_BSRR_BS15                       ((uint32)0x00008000)        /* Port x Set bit 15 */

