rakshith07/AUTOSAR-like-MCAL/MCAL/HW_Drivers/STM32F103Cxx.h
#define GPIO_BSRR_BR0                        ((uint32)0x00010000)        /* Port x Reset bit 0 */
#define GPIO_BSRR_BR1                        ((uint32)0x00020000)        /* Port x Reset bit 1 */
#define GPIO_BSRR_BR2                        ((uint32)0x00040000)        /* Port x Reset bit 2 */
#define GPIO_BSRR_BR3                        ((uint32)0x00080000)        /* Port x Reset bit 3 */
#define GPIO_BSRR_BR4                        ((uint32)0x00100000)        /* Port x Reset bit 4 */
#define GPIO_BSRR_BR5                        ((uint32)0x00200000)        /* Port x Reset bit 5 */
#define GPIO_BSRR_BR6                        ((uint32)0x00400000)        /* Port x Reset bit 6 */
#define GPIO_BSRR_BR7                        ((uint32)0x00800000)        /* Port x Reset bit 7 */
#define GPIO_BSRR_BR8                        ((uint32)0x01000000)        /* Port x Reset bit 8 */
#define GPIO_BSRR_BR9                        ((uint32)0x02000000)        /* Port x Reset bit 9 */
#define GPIO_BSRR_BR10                       ((uint32)0x04000000)        /* Port x Reset bit 10 */
#define GPIO_BSRR_BR11                       ((uint32)0x08000000)        /* Port x Reset bit 11 */
#define GPIO_BSRR_BR12                       ((uint32)0x10000000)        /* Port x Reset bit 12 */
#define GPIO_BSRR_BR13                       ((uint32)0x20000000)        /* Port x Reset bit 13 */
#define GPIO_BSRR_BR14                       ((uint32)0x40000000)        /* Port x Reset bit 14 */
#define GPIO_BSRR_BR15                       ((uint32)0x80000000)        /* Port x Reset bit 15 */

/*******************  Bit definition for GPIO_BRR register  *******************/
#define GPIO_BRR_BR0                         ((uint16)0x0001)            /* Port x Reset bit 0 */
#define GPIO_BRR_BR1                         ((uint16)0x0002)            /* Port x Reset bit 1 */
#define GPIO_BRR_BR2                         ((uint16)0x0004)            /* Port x Reset bit 2 */
#define GPIO_BRR_BR3                         ((uint16)0x0008)            /* Port x Reset bit 3 */
#define GPIO_BRR_BR4                         ((uint16)0x0010)            /* Port x Reset bit 4 */
#define GPIO_BRR_BR5                         ((uint16)0x0020)            /* Port x Reset bit 5 */
#define GPIO_BRR_BR6                         ((uint16)0x0040)            /* Port x Reset bit 6 */
#define GPIO_BRR_BR7                         ((uint16)0x0080)            /* Port x Reset bit 7 */
#define GPIO_BRR_BR8                         ((uint16)0x0100)            /* Port x Reset bit 8 */
#define GPIO_BRR_BR9                         ((uint16)0x0200)            /* Port x Reset bit 9 */
#define GPIO_BRR_BR10                        ((uint16)0x0400)            /* Port x Reset bit 10 */
#define GPIO_BRR_BR11                        ((uint16)0x0800)            /* Port x Reset bit 11 */
#define GPIO_BRR_BR12                        ((uint16)0x1000)            /* Port x Reset bit 12 */
#define GPIO_BRR_BR13                        ((uint16)0x2000)            /* Port x Reset bit 13 */
#define GPIO_BRR_BR14                        ((uint16)0x4000)            /* Port x Reset bit 14 */
#define GPIO_BRR_BR15                        ((uint16)0x8000)            /* Port x Reset bit 15 */

/******************  Bit definition for GPIO_LCKR register  *******************/
#define GPIO_LCKR_LCK0                       ((uint32)0x00000001)        /* Port x Lock bit 0 */
#define GPIO_LCKR_LCK1                       ((uint32)0x00000002)        /* Port x Lock bit 1 */
#define GPIO_LCKR_LCK2                       ((uint32)0x00000004)        /* Port x Lock bit 2 */
#define GPIO_LCKR_LCK3                       ((uint32)0x00000008)        /* Port x Lock bit 3 */
#define GPIO_LCKR_LCK4                       ((uint32)0x00000010)        /* Port x Lock bit 4 */
#define GPIO_LCKR_LCK5                       ((uint32)0x00000020)        /* Port x Lock bit 5 */
#define GPIO_LCKR_LCK6                       ((uint32)0x00000040)        /* Port x Lock bit 6 */
#define GPIO_LCKR_LCK7                       ((uint32)0x00000080)        /* Port x Lock bit 7 */
#define GPIO_LCKR_LCK8                       ((uint32)0x00000100)        /* Port x Lock bit 8 */
#define GPIO_LCKR_LCK9                       ((uint32)0x00000200)        /* Port x Lock bit 9 */
#define GPIO_LCKR_LCK10                      ((uint32)0x00000400)        /* Port x Lock bit 10 */
#define GPIO_LCKR_LCK11                      ((uint32)0x00000800)        /* Port x Lock bit 11 */
#define GPIO_LCKR_LCK12                      ((uint32)0x00001000)        /* Port x Lock bit 12 */
#define GPIO_LCKR_LCK13                      ((uint32)0x00002000)        /* Port x Lock bit 13 */
#define GPIO_LCKR_LCK14                      ((uint32)0x00004000)        /* Port x Lock bit 14 */
#define GPIO_LCKR_LCK15                      ((uint32)0x00008000)        /* Port x Lock bit 15 */
#define GPIO_LCKR_LCKK                       ((uint32)0x00010000)        /* Lock key */

/*----------------------------------------------------------------------------*/
#endif /* STM32F103CXX_H_ */
